package _3_ClassesAndObjects.Classes.Classes;

/**
 * Тело класса (область между фигурными скобками) содержит
 * весь код, который обеспечивает жизненный цикл объектов,
 * созданных из класса: конструкторы для инициализации новых
 * объектов, объявления для полей, которые предоставляют
 * состояние класса и его объектов, и методы для реализации
 * поведения класса и его объектов.
 * Можно предоставить дополнительную информацию о классе,
 * например, имя его суперкласса, реализует ли он какие-либо
 * интерфейсы и т. Д., В начале объявления класса. Например:
 *   class MyClass extends MySuperClass implements YourInterface {
 *     // field, constructor, and
 *     // method declarations
 * }
 * В общем, объявления классов могут включать компоненты в
 * следующем порядке:
 *  - Модификаторы, такие как public, private и ряд других.
 *  - Имя класса с начальной буквой, заглавной в соответствии
 *      с соглашением.
 *  - Имя родителя класса (суперкласса), если таковое имеется,
 *      с предшествующим ключевым словом extends. Класс может
 *      расширять (subclass) только одного родителя.
 *  - Разделенный запятыми список интерфейсов, реализованных
 *      классом, если таковые имеются, с предшествующим ключевым
 *      словом implements. Класс может реализовывать более
 *      одного интерфейса.
 *  - Тело класса, окруженное фигурными скобками, {}.
 */
public class DeclaringClasses {
}
