package _1_ObjectOrientedProg;

/**
 * Пакет - это пространство имен, которое организует набор
 * связанных классов и интерфейсов. Концептуально вы можете
 * считать пакеты похожими на разные папки на вашем компьютере.
 * Платформа Java предоставляет огромную библиотеку классов
 * (набор пакетов), подходящую для использования в ваших собственных
 * приложениях. Эта библиотека называется «Интерфейс прикладного
 * программирования» или «API» для краткости. Его пакеты представляют
 * задачи, наиболее часто связанные с программированием общего
 * назначения. Например, объект String содержит состояние и
 * поведение для символьных строк; объект File позволяет программисту
 * легко создавать, удалять, проверять, сравнивать или изменять
 * файл в файловой системе; Есть буквально тысячи классов на
 * выбор. Это позволяет вам, программисту, сосредоточиться на
 * дизайне вашего конкретного приложения, а не на инфраструктуре,
 * необходимой для его работы.
 * Спецификация API платформы Java содержит полный список
 * всех пакетов, интерфейсов, классов, полей и методов, предоставляемых
 * платформой Java SE.
 * https://docs.oracle.com/javase/8/docs/api/index.html
 */
public class Package_Is {
}
