package _2_LanguageBasic.Operators;

/**
 * Операторы - это специальные символы, которые выполняют определенные
 * операции с одним, двумя или тремя операндами, а затем возвращают
 * результат.
 * Операторы в следующей таблице перечислены в порядке приоритета.
 * Чем ближе к вершине таблицы появляется оператор, тем выше
 * его приоритет. Операторы с более высоким приоритетом оцениваются
 * перед операторами с относительно низким приоритетом. Операторы
 * в одной строке имеют одинаковый приоритет. Когда операторы
 * с одинаковым приоритетом появляются в одном и том же выражении,
 * правило должно определять, которое оценивается первым. Все
 * бинарные операторы, кроме операторов присваивания, оцениваются
 * слева направо; операторы присваивания оцениваются справа
 * налево.
     * postfix 	            expr++ expr--
     * unary 	            ++expr --expr +expr -expr ~ !
     * multiplicative 	       * / %
     * additive 	           + -
     * shift 	               << >> >>>
     * relational 	           < > <= >= instanceof
     * equality 	           == !=
     * bitwise AND 	            &
     * bitwise exclusive OR     ^
     * bitwise inclusive OR 	|
     * logical AND 	            &&
     * logical OR 	            ||
     * ternary 	                ? :
     * assignment 	= += -= *= /= %= &= ^= |= <<= >>= >>>=
 */
public class ReadMe_Operators {
}
