package _2_LanguageBasic.ControlFlowStatem;

/**
 * Операторы внутри ваших исходных файлов обычно выполняются
 * сверху вниз в порядке их появления. Операторы потока управления,
 * однако, разбивают поток выполнения, используя принятие
 * решений, циклы и переходы, позволяя вашей программе условно
 * выполнять определенные блоки кода. В этом разделе описываются
 * операторы принятия решений (if-then, if-then-else, switch),
 * циклические операторы (for, while, do-while) и операторы
 * ветвления (break, continue, return), поддерживаемые Java
 * язык программирования.
 */
public class ReadMeContrFlowStatements {
}
